-- phpMyAdmin SQL Dump
-- version 5.0.2
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2021-01-15 06:51:32
-- 伺服器版本： 10.4.14-MariaDB
-- PHP 版本： 7.4.10

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `db03`
--

-- --------------------------------------------------------

--
-- 資料表結構 `movie`
--

CREATE TABLE `movie` (
  `id` int(11) UNSIGNED NOT NULL,
  `name` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `level` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `length` int(10) UNSIGNED NOT NULL,
  `year` int(4) UNSIGNED NOT NULL,
  `month` tinyint(3) UNSIGNED NOT NULL,
  `day` tinyint(3) UNSIGNED NOT NULL,
  `ondate` date NOT NULL COMMENT '上映日',
  `publish` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `director` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `trailer` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `poster` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `intro` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `sh` tinyint(1) UNSIGNED NOT NULL,
  `rank` int(11) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `movie`
--

INSERT INTO `movie` (`id`, `name`, `level`, `length`, `year`, `month`, `day`, `ondate`, `publish`, `director`, `trailer`, `poster`, `intro`, `sh`, `rank`) VALUES
(1, '可能的任務8', '保護級', 55, 2021, 1, 15, '2021-01-15', '阿湯', '阿湯哥歌', '03B01v.mp4', '03B01.png', '阿湯哥防疫讚', 1, 2),
(2, '飛越太平洋', '輔導級', 66, 2021, 1, 11, '2021-01-11', '泰山高中', '菜菜', '03B02v.mp4', '03B02.png', '拉拉拉阿拉阿拉', 1, 1),
(3, '033', '普遍級', 33, 2021, 1, 11, '2021-01-11', '030', '033', '03B03v.mp4', '03B03.png', '030303030', 1, 3),
(4, '冰雪奇緣3', '限制級', 666, 2021, 1, 15, '2021-01-15', '444', '米沙', '03B04v.mp4', '03B04.png', '5444444444444444', 1, 5),
(6, 'ccc', '保護級', 70, 2021, 1, 15, '2021-01-15', 'cc', 'cc', '03B06v.mp4', '03B06.png', 'uyjrk', 1, 6),
(7, 'aaa', '限制級', 77, 2021, 1, 15, '2021-01-15', 'aaa', 'aaaaa', '03B03v.mp4', '03B04.png', 'vdfdhte', 1, 7),
(8, '院線片1', '保護及', 100, 2021, 3, 8, '0000-00-00', '院線片1的發行商', '院線片1的導演', '03B01v.mp4', '03B01.png', '院線片院線片院線片院線片院線片院線片院線片院線片院線片院線片', 1, 1),
(9, '院線片2', '限制級', 100, 2021, 3, 8, '0000-00-00', '院線片2的發行商', '院線片2的導演', '03B02v.mp4', '03B02.png', '院線片院線片院線片院線片院線片院線片院線片院線片院線片院線片', 1, 2),
(10, '院線片3', '限制級', 100, 2021, 3, 5, '0000-00-00', '院線片3的發行商', '院線片3的導演', '03B03v.mp4', '03B03.png', '院線片院線片院線片院線片院線片院線片院線片院線片院線片院線片', 1, 3),
(11, '院線片4', '保護及', 100, 2021, 3, 8, '0000-00-00', '院線片4的發行商', '院線片4的導演', '03B04v.mp4', '03B04.png', '院線片院線片院線片院線片院線片院線片院線片院線片院線片院線片', 1, 4),
(12, '院線片5', '保護及', 100, 2021, 3, 7, '0000-00-00', '院線片5的發行商', '院線片5的導演', '03B05v.mp4', '03B05.png', '院線片院線片院線片院線片院線片院線片院線片院線片院線片院線片', 1, 5),
(13, '院線片6', '保護及', 100, 2021, 3, 6, '0000-00-00', '院線片6的發行商', '院線片6的導演', '03B06v.mp4', '03B06.png', '院線片院線片院線片院線片院線片院線片院線片院線片院線片院線片', 1, 6),
(14, '院線片7', '', 100, 2021, 3, 6, '0000-00-00', '院線片7的發行商', '院線片7的導演', '03B07v.mp4', '03B07.png', '院線片院線片院線片院線片院線片院線片院線片院線片院線片院線片', 1, 7),
(15, '院線片8', '輔導級', 100, 2021, 3, 8, '0000-00-00', '院線片8的發行商', '院線片8的導演', '03B08v.mp4', '03B08.png', '院線片院線片院線片院線片院線片院線片院線片院線片院線片院線片', 1, 8),
(16, '院線片9', '保護及', 100, 2021, 3, 5, '0000-00-00', '院線片9的發行商', '院線片9的導演', '03B09v.mp4', '03B09.png', '院線片院線片院線片院線片院線片院線片院線片院線片院線片院線片', 1, 9),
(17, '院線片10', '限制級', 100, 2021, 3, 9, '0000-00-00', '院線片10的發行商', '院線片10的導演', '03B10v.mp4', '03B10.png', '院線片院線片院線片院線片院線片院線片院線片院線片院線片院線片', 1, 10),
(18, '院線片1', '限制級', 100, 2021, 3, 6, '0000-00-00', '院線片1的發行商', '院線片1的導演', '03B01v.mp4', '03B01.png', '院線片院線片院線片院線片院線片院線片院線片院線片院線片院線片', 1, 1),
(19, '院線片2', '限制級', 100, 2021, 3, 7, '0000-00-00', '院線片2的發行商', '院線片2的導演', '03B02v.mp4', '03B02.png', '院線片院線片院線片院線片院線片院線片院線片院線片院線片院線片', 1, 2),
(20, '院線片3', '輔導級', 100, 2021, 3, 7, '0000-00-00', '院線片3的發行商', '院線片3的導演', '03B03v.mp4', '03B03.png', '院線片院線片院線片院線片院線片院線片院線片院線片院線片院線片', 1, 3),
(21, '院線片4', '保護及', 100, 2021, 3, 9, '0000-00-00', '院線片4的發行商', '院線片4的導演', '03B04v.mp4', '03B04.png', '院線片院線片院線片院線片院線片院線片院線片院線片院線片院線片', 1, 4),
(22, '院線片5', '輔導級', 100, 2021, 3, 6, '0000-00-00', '院線片5的發行商', '院線片5的導演', '03B05v.mp4', '03B05.png', '院線片院線片院線片院線片院線片院線片院線片院線片院線片院線片', 1, 5),
(23, '院線片6', '', 100, 2021, 3, 6, '0000-00-00', '院線片6的發行商', '院線片6的導演', '03B06v.mp4', '03B06.png', '院線片院線片院線片院線片院線片院線片院線片院線片院線片院線片', 1, 6),
(24, '院線片7', '輔導級', 100, 2021, 3, 7, '0000-00-00', '院線片7的發行商', '院線片7的導演', '03B07v.mp4', '03B07.png', '院線片院線片院線片院線片院線片院線片院線片院線片院線片院線片', 1, 7),
(25, '院線片8', '輔導級', 100, 2021, 3, 6, '0000-00-00', '院線片8的發行商', '院線片8的導演', '03B08v.mp4', '03B08.png', '院線片院線片院線片院線片院線片院線片院線片院線片院線片院線片', 1, 8),
(26, '院線片9', '輔導級', 100, 2021, 3, 5, '0000-00-00', '院線片9的發行商', '院線片9的導演', '03B09v.mp4', '03B09.png', '院線片院線片院線片院線片院線片院線片院線片院線片院線片院線片', 1, 9),
(27, '院線片10', '保護及', 100, 2021, 3, 9, '0000-00-00', '院線片10的發行商', '院線片10的導演', '03B10v.mp4', '03B10.png', '院線片院線片院線片院線片院線片院線片院線片院線片院線片院線片', 1, 10),
(28, '院線片1', '輔導級', 100, 2021, 3, 9, '0000-00-00', '院線片1的發行商', '院線片1的導演', '03B01v.mp4', '03B01.png', '院線片1 的劇情介紹院線片1 的劇情介紹院線片1 的劇情介紹院線片1 的劇情介紹院線片1 的劇情介紹院線片1 的劇情介紹院線片1 的劇情介紹院線片1 的劇情介紹院線片1 的劇情介紹院線片1 的劇情介紹', 1, 1),
(29, '院線片2', '', 100, 2021, 3, 8, '0000-00-00', '院線片2的發行商', '院線片2的導演', '03B02v.mp4', '03B02.png', '院線片2 的劇情介紹院線片2 的劇情介紹院線片2 的劇情介紹院線片2 的劇情介紹院線片2 的劇情介紹院線片2 的劇情介紹院線片2 的劇情介紹院線片2 的劇情介紹院線片2 的劇情介紹院線片2 的劇情介紹', 1, 2),
(30, '院線片3', '', 100, 2021, 3, 8, '0000-00-00', '院線片3的發行商', '院線片3的導演', '03B03v.mp4', '03B03.png', '院線片3 的劇情介紹院線片3 的劇情介紹院線片3 的劇情介紹院線片3 的劇情介紹院線片3 的劇情介紹院線片3 的劇情介紹院線片3 的劇情介紹院線片3 的劇情介紹院線片3 的劇情介紹院線片3 的劇情介紹', 1, 3),
(31, '院線片4', '保護及', 100, 2021, 3, 9, '0000-00-00', '院線片4的發行商', '院線片4的導演', '03B04v.mp4', '03B04.png', '院線片4 的劇情介紹院線片4 的劇情介紹院線片4 的劇情介紹院線片4 的劇情介紹院線片4 的劇情介紹院線片4 的劇情介紹院線片4 的劇情介紹院線片4 的劇情介紹院線片4 的劇情介紹院線片4 的劇情介紹', 1, 4),
(32, '院線片5', '限制級', 100, 2021, 3, 9, '0000-00-00', '院線片5的發行商', '院線片5的導演', '03B05v.mp4', '03B05.png', '院線片5 的劇情介紹院線片5 的劇情介紹院線片5 的劇情介紹院線片5 的劇情介紹院線片5 的劇情介紹院線片5 的劇情介紹院線片5 的劇情介紹院線片5 的劇情介紹院線片5 的劇情介紹院線片5 的劇情介紹', 1, 5),
(33, '院線片6', '', 100, 2021, 3, 7, '0000-00-00', '院線片6的發行商', '院線片6的導演', '03B06v.mp4', '03B06.png', '院線片6 的劇情介紹院線片6 的劇情介紹院線片6 的劇情介紹院線片6 的劇情介紹院線片6 的劇情介紹院線片6 的劇情介紹院線片6 的劇情介紹院線片6 的劇情介紹院線片6 的劇情介紹院線片6 的劇情介紹', 1, 6),
(34, '院線片7', '限制級', 100, 2021, 3, 6, '0000-00-00', '院線片7的發行商', '院線片7的導演', '03B07v.mp4', '03B07.png', '院線片7 的劇情介紹院線片7 的劇情介紹院線片7 的劇情介紹院線片7 的劇情介紹院線片7 的劇情介紹院線片7 的劇情介紹院線片7 的劇情介紹院線片7 的劇情介紹院線片7 的劇情介紹院線片7 的劇情介紹', 1, 7),
(35, '院線片8', '', 100, 2021, 3, 8, '0000-00-00', '院線片8的發行商', '院線片8的導演', '03B08v.mp4', '03B08.png', '院線片8 的劇情介紹院線片8 的劇情介紹院線片8 的劇情介紹院線片8 的劇情介紹院線片8 的劇情介紹院線片8 的劇情介紹院線片8 的劇情介紹院線片8 的劇情介紹院線片8 的劇情介紹院線片8 的劇情介紹', 1, 8),
(36, '院線片9', '輔導級', 100, 2021, 3, 9, '0000-00-00', '院線片9的發行商', '院線片9的導演', '03B09v.mp4', '03B09.png', '院線片9 的劇情介紹院線片9 的劇情介紹院線片9 的劇情介紹院線片9 的劇情介紹院線片9 的劇情介紹院線片9 的劇情介紹院線片9 的劇情介紹院線片9 的劇情介紹院線片9 的劇情介紹院線片9 的劇情介紹', 1, 9),
(37, '院線片10', '限制級', 100, 2021, 3, 8, '0000-00-00', '院線片10的發行商', '院線片10的導演', '03B10v.mp4', '03B10.png', '院線片10 的劇情介紹院線片10 的劇情介紹院線片10 的劇情介紹院線片10 的劇情介紹院線片10 的劇情介紹院線片10 的劇情介紹院線片10 的劇情介紹院線片10 的劇情介紹院線片10 的劇情介紹院線片10 的劇情介紹', 1, 10),
(38, '院線片1', '限制級', 100, 2021, 3, 7, '0000-00-00', '院線片1的發行商', '院線片1的導演', '03B01v.mp4', '03B01.png', '院線片1 的劇情介紹院線片1 的劇情介紹院線片1 的劇情介紹院線片1 的劇情介紹院線片1 的劇情介紹院線片1 的劇情介紹院線片1 的劇情介紹院線片1 的劇情介紹院線片1 的劇情介紹院線片1 的劇情介紹', 1, 1),
(39, '院線片2', '普遍級', 100, 2021, 3, 9, '0000-00-00', '院線片2的發行商', '院線片2的導演', '03B02v.mp4', '03B02.png', '院線片2 的劇情介紹院線片2 的劇情介紹院線片2 的劇情介紹院線片2 的劇情介紹院線片2 的劇情介紹院線片2 的劇情介紹院線片2 的劇情介紹院線片2 的劇情介紹院線片2 的劇情介紹院線片2 的劇情介紹', 1, 2),
(40, '院線片3', '限制級', 100, 2021, 3, 9, '0000-00-00', '院線片3的發行商', '院線片3的導演', '03B03v.mp4', '03B03.png', '院線片3 的劇情介紹院線片3 的劇情介紹院線片3 的劇情介紹院線片3 的劇情介紹院線片3 的劇情介紹院線片3 的劇情介紹院線片3 的劇情介紹院線片3 的劇情介紹院線片3 的劇情介紹院線片3 的劇情介紹', 1, 3),
(41, '院線片4', '輔導級', 100, 2021, 3, 6, '0000-00-00', '院線片4的發行商', '院線片4的導演', '03B04v.mp4', '03B04.png', '院線片4 的劇情介紹院線片4 的劇情介紹院線片4 的劇情介紹院線片4 的劇情介紹院線片4 的劇情介紹院線片4 的劇情介紹院線片4 的劇情介紹院線片4 的劇情介紹院線片4 的劇情介紹院線片4 的劇情介紹', 1, 4),
(42, '院線片5', '普遍級', 100, 2021, 3, 7, '0000-00-00', '院線片5的發行商', '院線片5的導演', '03B05v.mp4', '03B05.png', '院線片5 的劇情介紹院線片5 的劇情介紹院線片5 的劇情介紹院線片5 的劇情介紹院線片5 的劇情介紹院線片5 的劇情介紹院線片5 的劇情介紹院線片5 的劇情介紹院線片5 的劇情介紹院線片5 的劇情介紹', 1, 5),
(43, '院線片6', '保護級', 100, 2021, 3, 9, '0000-00-00', '院線片6的發行商', '院線片6的導演', '03B06v.mp4', '03B06.png', '院線片6 的劇情介紹院線片6 的劇情介紹院線片6 的劇情介紹院線片6 的劇情介紹院線片6 的劇情介紹院線片6 的劇情介紹院線片6 的劇情介紹院線片6 的劇情介紹院線片6 的劇情介紹院線片6 的劇情介紹', 1, 6),
(44, '院線片7', '限制級', 100, 2021, 3, 9, '0000-00-00', '院線片7的發行商', '院線片7的導演', '03B07v.mp4', '03B07.png', '院線片7 的劇情介紹院線片7 的劇情介紹院線片7 的劇情介紹院線片7 的劇情介紹院線片7 的劇情介紹院線片7 的劇情介紹院線片7 的劇情介紹院線片7 的劇情介紹院線片7 的劇情介紹院線片7 的劇情介紹', 1, 7),
(45, '院線片8', '普遍級', 100, 2021, 3, 7, '0000-00-00', '院線片8的發行商', '院線片8的導演', '03B08v.mp4', '03B08.png', '院線片8 的劇情介紹院線片8 的劇情介紹院線片8 的劇情介紹院線片8 的劇情介紹院線片8 的劇情介紹院線片8 的劇情介紹院線片8 的劇情介紹院線片8 的劇情介紹院線片8 的劇情介紹院線片8 的劇情介紹', 1, 8),
(46, '院線片9', '普遍級', 100, 2021, 3, 5, '0000-00-00', '院線片9的發行商', '院線片9的導演', '03B09v.mp4', '03B09.png', '院線片9 的劇情介紹院線片9 的劇情介紹院線片9 的劇情介紹院線片9 的劇情介紹院線片9 的劇情介紹院線片9 的劇情介紹院線片9 的劇情介紹院線片9 的劇情介紹院線片9 的劇情介紹院線片9 的劇情介紹', 1, 9),
(47, '院線片10', '保護級', 100, 2021, 3, 5, '0000-00-00', '院線片10的發行商', '院線片10的導演', '03B10v.mp4', '03B10.png', '院線片10 的劇情介紹院線片10 的劇情介紹院線片10 的劇情介紹院線片10 的劇情介紹院線片10 的劇情介紹院線片10 的劇情介紹院線片10 的劇情介紹院線片10 的劇情介紹院線片10 的劇情介紹院線片10 的劇情介紹', 1, 10),
(48, '院線片1', '普遍級', 100, 2021, 3, 7, '0000-00-00', '院線片1的發行商', '院線片1的導演', '03B01v.mp4', '03B01.png', '院線片1 的劇情介紹院線片1 的劇情介紹院線片1 的劇情介紹院線片1 的劇情介紹院線片1 的劇情介紹院線片1 的劇情介紹院線片1 的劇情介紹院線片1 的劇情介紹院線片1 的劇情介紹院線片1 的劇情介紹', 1, 1),
(49, '院線片2', '保護級', 100, 2021, 3, 8, '0000-00-00', '院線片2的發行商', '院線片2的導演', '03B02v.mp4', '03B02.png', '院線片2 的劇情介紹院線片2 的劇情介紹院線片2 的劇情介紹院線片2 的劇情介紹院線片2 的劇情介紹院線片2 的劇情介紹院線片2 的劇情介紹院線片2 的劇情介紹院線片2 的劇情介紹院線片2 的劇情介紹', 1, 2),
(50, '院線片3', '輔導級', 100, 2021, 3, 6, '0000-00-00', '院線片3的發行商', '院線片3的導演', '03B03v.mp4', '03B03.png', '院線片3 的劇情介紹院線片3 的劇情介紹院線片3 的劇情介紹院線片3 的劇情介紹院線片3 的劇情介紹院線片3 的劇情介紹院線片3 的劇情介紹院線片3 的劇情介紹院線片3 的劇情介紹院線片3 的劇情介紹', 1, 3),
(51, '院線片4', '普遍級', 100, 2021, 3, 6, '0000-00-00', '院線片4的發行商', '院線片4的導演', '03B04v.mp4', '03B04.png', '院線片4 的劇情介紹院線片4 的劇情介紹院線片4 的劇情介紹院線片4 的劇情介紹院線片4 的劇情介紹院線片4 的劇情介紹院線片4 的劇情介紹院線片4 的劇情介紹院線片4 的劇情介紹院線片4 的劇情介紹', 1, 4),
(52, '院線片5', '普遍級', 100, 2021, 3, 9, '0000-00-00', '院線片5的發行商', '院線片5的導演', '03B05v.mp4', '03B05.png', '院線片5 的劇情介紹院線片5 的劇情介紹院線片5 的劇情介紹院線片5 的劇情介紹院線片5 的劇情介紹院線片5 的劇情介紹院線片5 的劇情介紹院線片5 的劇情介紹院線片5 的劇情介紹院線片5 的劇情介紹', 1, 5),
(53, '院線片6', '限制級', 100, 2021, 3, 7, '0000-00-00', '院線片6的發行商', '院線片6的導演', '03B06v.mp4', '03B06.png', '院線片6 的劇情介紹院線片6 的劇情介紹院線片6 的劇情介紹院線片6 的劇情介紹院線片6 的劇情介紹院線片6 的劇情介紹院線片6 的劇情介紹院線片6 的劇情介紹院線片6 的劇情介紹院線片6 的劇情介紹', 1, 6),
(54, '院線片7', '普遍級', 100, 2021, 3, 5, '0000-00-00', '院線片7的發行商', '院線片7的導演', '03B07v.mp4', '03B07.png', '院線片7 的劇情介紹院線片7 的劇情介紹院線片7 的劇情介紹院線片7 的劇情介紹院線片7 的劇情介紹院線片7 的劇情介紹院線片7 的劇情介紹院線片7 的劇情介紹院線片7 的劇情介紹院線片7 的劇情介紹', 1, 7),
(55, '院線片8', '輔導級', 100, 2021, 3, 7, '0000-00-00', '院線片8的發行商', '院線片8的導演', '03B08v.mp4', '03B08.png', '院線片8 的劇情介紹院線片8 的劇情介紹院線片8 的劇情介紹院線片8 的劇情介紹院線片8 的劇情介紹院線片8 的劇情介紹院線片8 的劇情介紹院線片8 的劇情介紹院線片8 的劇情介紹院線片8 的劇情介紹', 1, 8),
(56, '院線片9', '輔導級', 100, 2021, 3, 6, '0000-00-00', '院線片9的發行商', '院線片9的導演', '03B09v.mp4', '03B09.png', '院線片9 的劇情介紹院線片9 的劇情介紹院線片9 的劇情介紹院線片9 的劇情介紹院線片9 的劇情介紹院線片9 的劇情介紹院線片9 的劇情介紹院線片9 的劇情介紹院線片9 的劇情介紹院線片9 的劇情介紹', 1, 9),
(57, '院線片10', '輔導級', 100, 2021, 3, 9, '0000-00-00', '院線片10的發行商', '院線片10的導演', '03B10v.mp4', '03B10.png', '院線片10 的劇情介紹院線片10 的劇情介紹院線片10 的劇情介紹院線片10 的劇情介紹院線片10 的劇情介紹院線片10 的劇情介紹院線片10 的劇情介紹院線片10 的劇情介紹院線片10 的劇情介紹院線片10 的劇情介紹', 1, 10);

-- --------------------------------------------------------

--
-- 資料表結構 `orders`
--

CREATE TABLE `orders` (
  `id` int(11) UNSIGNED NOT NULL,
  `num` varchar(12) COLLATE utf8mb4_unicode_ci NOT NULL,
  `movie` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `date` date NOT NULL,
  `session` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `seats` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `quantity` int(2) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `orders`
--

INSERT INTO `orders` (`id`, `num`, `movie`, `date`, `session`, `seats`, `quantity`) VALUES
(1, '202101110001', '飛越太平洋', '2021-01-11', '18:00~20:00', 'a:3:{i:0;s:1:\"6\";i:1;s:1:\"7\";i:2;s:1:\"8\";}', 3),
(2, '202101150002', 'aaa', '2021-01-16', '18:00~20:00', 'a:4:{i:0;s:1:\"2\";i:1;s:1:\"6\";i:2;s:1:\"8\";i:3;s:1:\"9\";}', 4),
(3, '202101150003', '可能的任務8', '2021-01-15', '14:00~16:00', 'a:2:{i:0;s:1:\"1\";i:1;s:1:\"2\";}', 2),
(4, '202101150004', '可能的任務8', '2021-01-15', '14:00~16:00', 'a:4:{i:0;s:1:\"7\";i:1;s:1:\"8\";i:2;s:2:\"12\";i:3;s:2:\"13\";}', 4),
(6, '202101150005', '冰雪奇緣3', '2021-01-16', '16:00~18:00', 'a:3:{i:0;s:1:\"6\";i:1;s:1:\"7\";i:2;s:2:\"12\";}', 3),
(7, '202101150007', '冰雪奇緣3', '2021-01-16', '16:00~18:00', 'a:2:{i:0;s:1:\"8\";i:1;s:1:\"9\";}', 2),
(8, '202101150008', 'ccc', '2021-01-15', '14:00~16:00', 'a:4:{i:0;s:1:\"6\";i:1;s:1:\"7\";i:2;s:2:\"11\";i:3;s:2:\"12\";}', 4),
(9, '202101150009', '可能的任務8', '2021-01-15', '14:00~16:00', 'a:2:{i:0;s:1:\"9\";i:1;s:2:\"19\";}', 2);

-- --------------------------------------------------------

--
-- 資料表結構 `poster`
--

CREATE TABLE `poster` (
  `id` int(11) UNSIGNED NOT NULL,
  `name` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `img` text COLLATE utf8mb4_unicode_ci NOT NULL,
  `sh` tinyint(1) NOT NULL,
  `rank` int(10) UNSIGNED NOT NULL,
  `ani` int(11) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `poster`
--

INSERT INTO `poster` (`id`, `name`, `img`, `sh`, `rank`, `ani`) VALUES
(1, 'a2', '03A01.jpg', 1, 1, 2),
(2, 'b1', '03A02.jpg', 1, 3, 1),
(3, 'c4', '03A03.jpg', 1, 2, 4),
(4, '43', '03A04.jpg', 1, 4, 3),
(5, '91', '03A09.jpg', 1, 5, 1),
(6, '85', '03A08.jpg', 1, 6, 5),
(7, '預告片1', '03A01.jpg', 1, 1, 1),
(8, '預告片2', '03A02.jpg', 1, 2, 3),
(9, '預告片3', '03A03.jpg', 1, 3, 1),
(10, '預告片4', '03A04.jpg', 1, 4, 3),
(11, '預告片5', '03A05.jpg', 1, 5, 1),
(12, '預告片6', '03A06.jpg', 1, 6, 2),
(13, '預告片7', '03A07.jpg', 1, 7, 3),
(14, '預告片8', '03A08.jpg', 1, 8, 1),
(15, '預告片9', '03A09.jpg', 1, 9, 1),
(16, '預告片1', '03A01.jpg', 1, 1, 1),
(17, '預告片2', '03A02.jpg', 1, 2, 2),
(18, '預告片3', '03A03.jpg', 1, 3, 1),
(19, '預告片4', '03A04.jpg', 1, 4, 1),
(20, '預告片5', '03A05.jpg', 1, 5, 3),
(21, '預告片6', '03A06.jpg', 1, 6, 1),
(22, '預告片7', '03A07.jpg', 1, 7, 1),
(23, '預告片8', '03A08.jpg', 1, 8, 2),
(24, '預告片9', '03A09.jpg', 1, 9, 2),
(25, '預告片1', '03A01.jpg', 1, 1, 2),
(26, '預告片2', '03A02.jpg', 1, 2, 1),
(27, '預告片3', '03A03.jpg', 1, 3, 3),
(28, '預告片4', '03A04.jpg', 1, 4, 3),
(29, '預告片5', '03A05.jpg', 1, 5, 1),
(30, '預告片6', '03A06.jpg', 1, 6, 3),
(31, '預告片7', '03A07.jpg', 1, 7, 3),
(32, '預告片8', '03A08.jpg', 1, 8, 2),
(33, '預告片9', '03A09.jpg', 1, 9, 2),
(34, '預告片1', '03A01.jpg', 1, 1, 3),
(35, '預告片2', '03A02.jpg', 1, 2, 2),
(36, '預告片3', '03A03.jpg', 1, 3, 2),
(37, '預告片4', '03A04.jpg', 1, 4, 2),
(38, '預告片5', '03A05.jpg', 1, 5, 2),
(39, '預告片6', '03A06.jpg', 1, 6, 1),
(40, '預告片7', '03A07.jpg', 1, 7, 3),
(41, '預告片8', '03A08.jpg', 1, 8, 2),
(42, '預告片9', '03A09.jpg', 1, 9, 2);

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `movie`
--
ALTER TABLE `movie`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `poster`
--
ALTER TABLE `poster`
  ADD PRIMARY KEY (`id`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `movie`
--
ALTER TABLE `movie`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=58;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `orders`
--
ALTER TABLE `orders`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `poster`
--
ALTER TABLE `poster`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=43;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
